<!--
 * @Description: 学生注册 -> 《虚拟仿真平台服务条款》
 * 详细说明：每一行都用<p></p>包裹；class="text-index"为标题；<span></span>为文字加粗；<u></u>为下划线、文字加粗；
 *           <div></div>包裹的内容使每个<p>行距小，用于存在4级内容，在三级内容中使用（如：<div><p><u><u/></p><p></p></div>）
-->
<template>
  <div class="egister-clause">
    <p>虚拟仿真平台服务条款</p>
    
    <h1 class="h1-title">虚拟仿真平台帐号服务条款</h1>
    <p class="text-index">
      <u>欢迎申请使用威爱数矩科技有限公司（以下简称数矩）提供的产品和服务。</u>
      <span>请您（下列统称为“用户”）仔细阅读、充分理解以下全部内容，</span> 
      <u>其中限制或免除责任的条款，以及其他涉及用户重大权益的条款（如违约处罚、争议管辖等）将会以加粗或下划线标注等形式提示用户重点注意。</u>
    </p>
    
    <p class="title">一、服务条款的确认和接纳</p>
    <p>
      1.1本服务条款是用户与成都威爱数矩科技有限公司之间关于其注册以及使用成都威爱数矩科技有限公司提供的相关产品和服务所订立的协议。
      <span>如用户选择以页面确认或其他任何方式明示或者默示表示接受本服务条款，或以下载、安装、登录等方式使用成都威爱数矩科技有限公司提供的相关产品和服务，即表示用户与成都威爱数矩科技有限公司已达成协议，自愿接受本服务条款的所有内容。</span>
      如用户不同意本服务条款任意内容，请勿注册帐号或使用成都威爱数矩科技有限公司提供的相关产品和服务。
    </p>
    <p>
      1.2本服务条款的效力范围及于成都威爱数矩科技有限公司提供的通过学号注册和使用的全部产品和服务，除成都威爱数矩科技有限公司另行明确声明外，用户在使用任何本公司单项服务时，将受本服务条款的约束。
      <u>当用户使用数矩各单项服务时，用户同意以单项服务要求的方式同意该单项服务的服务条款以及数矩公司在该单项服务中发出的各类公告、规则（下列统称为“单项条款”），在此情况下单项条款与本服务条款同时对用户产生效力。若单项条款与本服务条款存在同类条款的冲突，则在单项条款约束范围内应以单项条款为准。
      1.3数矩公司有权在必要时通过在网页上发出公告等合理方式修改本服务条款以及各单项条款。用户在享受数矩各单项服务时，应当及时查阅了解修改的内容，并自觉遵守本服务条款以及该单项服务的相关条款。用户如继续使用本服务条款涉及的产品和服务，则视为对修改内容的同意，当发生有关争议时，以最新的条款内容为准；用户在不同意修改内容的情况下，有权停止使用本服务条款涉及的产品和服务。
      </u>
    </p>
    
    <p class="title">二、学号帐号服务简介</p>
    <p><u>2.1本服务条款所称的“学号帐号”是指用户注册的合法、有效的帐号，</u></p>
    <p><u>2.2用户理解并确认，学号帐号是数矩公司按照本服务条款授权注册用户使用数矩服务的数字标识。在法律法规允许的范围内，学号帐号的所有权，以及与注册、使用学号帐号相关的服务数据和记录，包括但不限于所有注册、登录、消费记录、产品日志、客服记录和相关的使用统计数据等，归数矩公司或具体产品运营主体所有。</u></p>
    <div>
      <p>2.3用户完成学号帐号申请注册程序后，数矩公司按照本服务条款授权用户使用数矩服务，或者以数矩公司明确许可的其他目的，依照数矩公司的服务规则使用该帐号。数矩公司运用自己的操作系统通过国际互联网络为用户提供各项服务。用户必须：</p>
      <p>（1）提供设备，如个人电脑、手机或其他上网设备；</p>
      <p>（2）个人上网和支付与此服务有关的费用。</p>
    </div>
    
    <p class="title">三、数矩学号帐号注册规则</p>
    <p>
      3.1用户确认，在注册或使用数矩服务时，应当具备中华人民共和国法律规定的与其行为相适应的民事行为能力，确保有能力对所使用数矩服务的一切行为独立承担责任。
      <u>若用户不具备前述主体资格，请在监护人的陪同下阅读本服务条款，并在取得监护人对本服务条款及对使用数矩服务的行为的同意之后，方可注册并使用数矩服务；数矩公司在依据法律规定或本服务条款要求用户承担责任时，有权向其监护人追偿。</u>
    </p>
    <p>3.2用户还需确保其不是任何国家、国际组织或者地域实施的贸易限制、制裁或其他法律、规则限制的对象，也未直接或间接为前述对象提供资金、商品或服务，否则应当停止注册或使用数矩服务，同时用户理解违反前述要求可能会造成其无法正常注册及使用数矩服务。</p>
    <div>
      <p>3.3学号帐号注册资料包括但不限于用户的学号帐号名称、头像、密码、注册或更新学号帐号时输入的所有信息以及用户使用数矩各单项服务时输入的名称、头像等所有信息。用户在注册数矩学号帐号时承诺遵守法律法规、社会主义制度、国家利益、公民合法权益、公共秩序、社会道德风尚和信息真实性等底线和准则，不得在数矩学号帐号注册资料中出现违法和不良信息，且用户保证其在注册和使用帐号时，不得有以下情形：</p>
      <p>（1）违反宪法或法律法规规定的； </p>
      <p>（2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</p>
      <p>（3）损害国家荣誉和利益的，损害公共利益的；</p>
      <p>（4）歪曲、丑化、亵渎、否定英雄烈士事迹和精神，以侮辱、诽谤或者其他方式侵害英雄烈士的姓名、肖像、名誉、荣誉的；</p>
      <p>（5）宣扬恐怖主义、极端主义或者煽动实施恐怖活动、极端主义活动的；</p>
      <p>（6）煽动民族仇恨、民族歧视，破坏民族团结的；</p>
      <p>（7）破坏国家宗教政策，宣扬邪教和封建迷信的；</p>
      <p>（8）散布谣言，扰乱社会秩序，破坏社会稳定的；</p>
      <p>（9）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</p>
      <p>（10）侮辱或者诽谤他人，侵害他人合法权益的；</p>
      <p>（11）含有法律、行政法规禁止的其他内容的。</p>
      <p class="text-index">若用户提供给数矩公司的帐号注册资料不准确，不真实，含有违法或不良信息的，数矩公司有权不予注册，并保留终止用户使用数矩学号帐号及数矩服务的权利。若用户以虚假信息骗取帐号注册或帐号头像、个人简介等注册资料存在违法和不良信息的，数矩公司有权采取通知限期改正、暂停使用、注销登记等措施。对于冒用关联机构或社会名人注册帐号名称的，数矩公司有权注销该帐号，并向政府主管部门进行报告。</p>
    </div>
    <div>
      <p>3.4根据相关法律、法规规定以及考虑到数矩服务的重要性，用户同意：</p>
      <p>（1）提供必要、准确的账户注册资料，并不断更新注册资料，以便数矩公司向用户提供帮助、或更好地为用户提供服务。</p>
      <p class="text-index">若用户提交的信息不真实、不完整或不准确，则可能无法使用数矩服务或在使用过程中受到限制。</p>
    </div>
    <p>
      3.5用户同意，其提供的真实、准确、合法的学号帐号注册资料是作为认定用户与其学号帐号的关联性以及用户身份的唯一证据。用户在享用数矩各项服务的同时，同意接受数矩提供的各类信息服务。
      <u>发生争议时，用户同意以数矩公司或具体产品运营主体的系统数据为准，数矩公司保证该数据的真实性。</u>
    </p>
    
    <p class="title"><u>四、服务的变更、中止、取消或终止</u></p>
    <p>
      <u>4.1数矩公司始终在不断变更和改进服务。数矩公司可能会增加或删除功能，也可能暂停或彻底停止某项服务。用户同意数矩公司根据自身商业决策等原因可能会选择终止数矩学号帐号服务或其他数矩服务。如有此等情形发生，数矩公司会采取网站公告等合理形式通知用户。除法律有明确规定的情况外，数矩公司有权不经用户申请并直接为其办理余额退款（如有）。</u>
    </p>
    <p>
      <u>4.2经国家行政或司法机关的生效法律文书确认用户存在违法或侵权行为，或者数矩公司根据自身的判断，认为用户的行为涉嫌违反本服务条款或数矩公司不时公布的使用规则等内容，或涉嫌违反法律法规的规定的，则数矩公司有权不经任何通知直接中止、中断或终止向用户提供服务，并不承担任何责任。</u>
    </p>
    <p>
      <u>4.3数矩公司有权根据实际情况自行决定向单个用户提供的数矩学号帐号服务或其他数矩服务的服务标准。</u>
    </p>
    <p>
      <u>4.4用户可根据自己的需要自行备份数矩学号帐号服务或其他数矩服务中的相关数据；如果用户主动停止使用相关服务或服务被终止或取消，数矩公司有权从服务器上永久地删除用户的数据。服务停止、终止或取消后，数矩公司没有义务向用户返还任何数据且不予退还用户已经支付但未消费完毕的费用。</u>
    </p>
    
    <p class="title"><u>五、用户隐私制度</u></p>
    <p>
      <u>尊重用户隐私是数矩公司的一项基本政策。数矩公司将按照公司隐私政策收集、存储、使用、披露和保护用户的个人信息。请用户完整阅读上述隐私权政策，以帮助更好地保护自身个人信息。</u>
    </p>
    
    <p class="title">六、帐号安全和保障</p>
    <p>6.1用户的帐号为其自行设置并由用户自行保管。用户应维持密码及帐号的机密安全，如果用户未保管好自己的帐号、密码或其他信息（包括但不限于帐号注册信息、操作记录）而对用户、数矩公司或第三方造成损害，用户将负全部责任。</p>
    <p>6.2数矩公司根据本服务条款对数矩学号帐号的使用授权，仅限于初始申请注册人。未经数矩公司明确许可，初始申请注册人不得赠与、借用、租用、转让或售卖数矩学号帐号或者以其他方式许可其他主体使用数矩学号帐号。否则，用户应当自行承担由此产生的任何责任和后果；同时，数矩公司保留在未经通知的情况下中止、中断或终止使用该帐号，并追究上述行为人法律责任的权利。</p>
    <p>6.3用户同意，若发现任何非法使用用户帐号或安全漏洞的情况，有义务立即通告数矩公司。数矩公司将协助用户冻结帐号、更改密码或进行其他安全设置。用户理解并同意，数矩公司对其请求采取行动需要合理的时间，对在采取行动前已经产生的以及由用户引发的后果（包括但不限于用户的任何损失）不承担任何责任。</p>
    <p>6.4为了保护用户帐号的安全，使用户可以更加安全地使用数矩服务，数矩公司可能会不断升级、完善我们的安全技术防护措施。若数矩公司根据自己的判断发现用户的帐号存在或可能存在被盗号等安全隐患时，为了保障用户的帐号安全、财产免受损失等，可能会采取向用户发出一定的提示、中止用户对帐号的使用，或者在用户登录或使用帐号时采取一定的措施，包括但不限于要求用户验证/更改/绑定安全邮箱、修改密码等，用户需配合数矩公司进行相应的帐号保护操作。用户理解并同意，如果拒绝数矩公司的帐号保护操作，或未能通过数矩公司的帐号保护操作，数矩公司有权不予恢复该帐号的使用权，或限制该帐号的部分或全部功能。</p>
    <div>
      <p>6.5因用户遗忘、遗失密码或其他原因导致数矩学号帐号无法正常登录，用户可以通过密保邮箱找回密码：</p>
      <p>（1）用户可以通过密保邮箱进行验证；如验证通过，用户可以重置密码，从而继续使用该帐号；</p>
      <p>
        （2）若该帐号无法通过已绑定密保邮箱找回密码，用户可以向数矩公司申请修复帐号，帐号修复申请通过后，用户可重置密码，从而实现正常登录。在帐号修复过程中，为了用户的帐号安全，用户应配合如实提供身份证明及相关资料，以便数矩公司进行核实，并与系统记录的信息进行匹配。数矩公司将不断采取各种措施完善帐号修复程序，
        <u>但帐号修复结果取决于用户提交的信息和资料的准确性、完整性、有效性以及其他各种因素，用户应充分理解其帐号修复申请并不必然被通过，数矩公司有权综合各种情况决定是否同意用户的帐号修复申请。</u>
      </p>
    </div>
    <p>
      6.6如数矩学号帐号涉及行政、司法调查，或因其他原因存在争议、纠纷或安全风险，数矩公司可能会对相应帐号暂时冻结。
      <u>帐号冻结期间，用户不得提起修复申请，数矩公司亦有权不受理修复申请或不予通过修复申请。</u>
    </p>
    
    <p class="title">七、用户行为规范</p>
    <p>7.1用户理解并同意，数矩公司一直致力于为用户提供文明健康、规范有序的网络环境，用户对数矩服务的使用必须遵守所有适用于服务以及用户所属和/或所处国家或地区的地方法律、国家法律和国际法律，不得利用数矩服务从事违法违规、干扰数矩服务正常运营、以及侵犯其他用户或第三方合法权益的行为。</p>
    <div>
      <p><span>7.2 用户不得在数矩服务的页面上或者利用数矩服务制作、复制、发布、传播以下信息：</span></p>
      <p>(1) 违反宪法确定的基本原则的；</p>
      <p>(2) 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</p>
      <p>(3) 损害国家荣誉和利益的；</p>
      <p>(4) 歪曲、丑化、亵渎、否定英雄烈士事迹和精神，以侮辱、诽谤或者其他方式侵害英雄烈士的姓名、肖像、名誉、荣誉的；</p>
      <p>(5) 宣扬恐怖主义、极端主义或者煽动实施恐怖活动、极端主义活动的；</p>
      <p>(6) 煽动民族仇恨、民族歧视，破坏民族团结的；</p>
      <p>(7) 破坏国家宗教政策，宣扬邪教和封建迷信的；</p>
      <p>(8) 散布谣言，扰乱社会秩序，破坏社会稳定的；</p>
      <p>(9) 散布淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的；</p>
      <p>(10) 侮辱或者诽谤他人，侵害他人合法权益的；</p>
      <p>(11) 煽动非法集会、结社、游行、示威、聚众扰乱社会秩序的；</p>
      <p>(12) 以非法民间组织名义活动的；</p>
      <p>(13) 可能引发未成年人模仿不安全行为和违反社会公德行为、诱导未成年人不良嗜好等损害未成年人身心健康的；</p>
      <p>(14) 散布商业广告，或类似的商业招揽信息、过度营销信息及垃圾信息的；</p>
      <p>(15) 所发表的信息毫无意义的，或刻意使用字符组合以逃避技术审核的；</p>
      <p>(16) 含有法律、行政法规禁止或其他违反社会公序良俗的内容的。</p>
    </div>
    <div>
      <p><span>7.3 用户不得利用数矩服务从事以下行为：</span></p>
      <p>(1) 故意制作、传播计算机病毒等破坏性程序的，以及非法侵入他人网络、干扰他人网络正常功能、窃取网络数据等危害网络安全的行为；</p>
      <p>(2) 向他人提供专门用于从事侵入网络、干扰网络正常功能及防护措施、窃取网络数据等危害网络安全活动的程序、工具，或明知他人从事危害网络安全的活动的，为其提供技术支持、广告推广、支付结算等帮助的行为；</p>
      <p>(3) 设立用于实施诈骗，传授犯罪方法，制作或者销售违禁物品、管制物品等违法犯罪活动的网站、通讯群组的行为；</p>
      <p>(4) 发布、传送、传播、储存侵害他人名誉权、肖像权、个人隐私、知识产权、商业秘密等合法权利的内容，以及从事侵犯他人合法权利的其他行为；</p>
      <p>(5) 发表、传送、传播骚扰、广告信息及垃圾信息；</p>
      <p>(6)干扰或破坏数矩服务的正常运行，以及其他危害计算机信息网络安全的行为；</p>
      <p>(7)其他违反任何相关的法律、法规、规章、条例等其他具有法律效力的规范，以及数矩公司的所有其他规定和程序的行为。</p>
    </div>
    <div>
      <p><span>7.4除非法律允许或数矩公司书面许可，用户使用数矩服务的过程中不得从事下列行为：</span></p>
      <p>(1) 删除数矩服务的应用程序及其副本上关于知识产权的信息；</p>
      <p>(2) 对数矩服务的应用程序进行反向工程、反向汇编、反向编译，或者以其他方式尝试发现数矩服务的应用程序的源代码；</p>
      <p>(3) 对数矩公司拥有知识产权的内容进行使用、出租、出借、复制、修改、链接、转载、汇编、发表、出版、建立镜像站点等；</p>
      <p>(4) 进入数矩服务的计算机信息网络、系统或者使用计算机信息网络资源的；</p>
      <p>(5) 对数矩服务的应用程序和功能、运行中的指令、存储/处理或者传输的数据进行复制、删除、修改、增加、挂接运行或创作任何衍生作品，形式包括但不限于使用插件、外挂或非数矩公司经授权的第三方工具/服务接入数矩服务和相关系统；或者将用于上述用途的软件、方法进行运营或向公众传播，无论这些行为是否为商业目的的；</p>
      <p>(6) 通过非数矩公司开发、授权的第三方软件、插件、外挂、系统，登录或使用数矩服务，或制作、发布、传播上述工具；</p>
      <p>(7) 自行或者授权他人、第三方软件对数矩公司的应用程序及其组件、模块、数据进行干扰；</p>
      <p>(8) 其他未经数矩公司明示授权的行为。</p>
    </div>
    <div>
      <p><u>7.5用户承诺，非经数矩公司同意，用户不能利用数矩各项服务进行销售或其他商业用途。如用户有需要将服务用于商业用途，应书面通知数矩公司并获得数矩公司的明确授权。</u></p>
    </div>
    
    <p class="title">八、责任承担和责任限制</p>
    <p>
      <span>8.1用户须为自己数矩学号帐号下的一切行为承担法律责任，包括用户所发表的任何内容以及其它人使用用户的电脑、手机、帐号而产生的任何后果。</span>
      <u>如用户或使用用户帐号的其他人利用数矩公司的服务侵害他人民事权益的，用户应当承担侵权等法律责任。</u>
      <span>用户承担法律责任的形式包括但不限于：对受到侵害者进行赔偿，以及在数矩公司首先承担了因用户行为导致的行政处罚或侵权损害赔偿责任后，用户应给予数矩公司等额的赔偿。</span>
    </p>
    <p>
      <u>8.2用户理解，如数矩公司发现或者收到被侵权人举报或投诉用户的行为存在违反相关法律法规、本服务条款规定情形的，数矩公司有权根据自己的判断不经通知随时采取限制、中止、冻结或终止用户对数矩服务的使用等措施，并依据法律法规保存有关信息向国家有关机关报告等；由此给用户带来的一切损失（包括但不限于通信中断，用户资料、邮件和虚拟财产及相关数据、增值服务、产品或服务等的清空或无法使用等），由用户自行承担且数矩公司不退还用户已支付但尚未使用完毕的费用。</u>
    </p>
    <p>
      <span>8.3用户理解，为保证数矩服务的安全性及产品功能的一致性，数矩公司将不定期对数矩服务进行更新。用户应将软件更新到最新版本，如用户未及时更新到最新版本，数矩公司不保证用户一定能正常使用数矩服务。</span>
    </p>
    <p>
      <u>8.4数矩公司对数矩学号帐号上所有服务将尽力维护其安全性及方便性，但对服务中出现的信息（包括但不限于用户发布的信息）删除或储存失败不承担任何责任。</u>
    </p>
    <p>
      <span>8.5除非由于数矩原因导致，否则数矩公司将不承担任何退还已收取费用的义务。</span>
    </p>
    <p>
      <span>8.6在法律法规允许的范围内，数矩公司不对与本服务条款有关或由本服务条款引起的任何间接的、惩罚性的、特殊的、派生的损失承担赔偿责任。</span>
    </p>
    
    <p class="title">九、不可抗力及其他免责事由</p>
    <div>
      <p class="text-index">
        <span>用户理解并同意，鉴于互联网的特殊性，在使用数矩服务的过程中可能会遇到以下情况使服务发生中断，出现下述情况时，不视为数矩公司违约，若由此给用户造成的损失数矩公司将予以免责。</span>
      </p>
      <p>
        <span>（1）不可抗力，包括但不限于自然灾害、疫情、政府行为、法律法规颁布调整、战争动乱、通信线路中断、网络攻击、病毒入侵、网路故障、电信部门技术调整和政府管制等不能预见、不能克服并不能避免的客观情况；</span>
      </p>
      <p>
        <span>（2）数矩公司在进行机房维护、设备检修、系统升级或优化时，需要中断服务的；</span>
      </p>
      <p>
        <span>（3）由于网络信号不稳定、网络带宽小、网络拥堵等网络问题以及系统或设备故障等原因，所引起的本服务或账号登录失败、账号信息同步不完整、页面打开速度慢等风险；</span>
      </p>
      <p>
        <span>（4）由于用户自身或第三方的原因导致的服务中断、终止，包括用户操作不当、第三方产品或服务提供者的软硬件故障等。</span>
      </p>
    </div>
    
    <p class="title">十、通知、广告</p>
    <p>
      10.1所有发给用户的通知都可通过电子邮件、常规的信件或在网站显著位置公告等方式进行传送。数矩公司将通过上述方法之一将消息传递给用户，告知他们服务条款的修改、服务变更、或其它重要事情。
    </p>
    <p>
      10.2用户同意数矩公司可以利用数矩服务多次、长期地发布各种形式的商业性及非商业性广告、通知和短信息，包括但不限于在数矩服务的登录页面及登录后任何页面内放置广告、向数矩服务的用户发送广告邮件、短信息以及在数矩服务的用户发出的电子邮件内附上广告及／或广告链接等形式。
    </p>
    
    <p class="title">十一、知识产权声明</p>
    <div>
      <p> 11.1数矩公司提供服务时涉及到的数矩产品的所有权以及相关软件的知识产权归数矩公司所有。 </p>
      <p>（1）数矩公司提供的内容包括但不限于：非用户上传/提供的文字、软件、图片、音频、视频、图表、程序代码、界面设计、版面框架、数据资料、账号等，所有这些内容的知识产权及相关智力成果的权利均属于数矩公司，并受版权、商标、专利和其它相关法律的保护。未经数矩公司授权，用户不得使用上述内容，并且用户未经许可，不得对上述内容进行包括但不限于复制、销售、重制、再创作等行为。</p>
      <p>（2）数矩公司注册的VIVEDM以及数矩公司的其他标志及数矩产品、服务的名称，均为数矩公司之商标（以下简称“数矩标识”）。未经数矩公司事先书面同意，用户不得将数矩标识及数矩公司享有相关权利的其他标识以不合法或不合理的任何方式使用或作其他处理，也不得向他人表明用户有权使用数矩标识。</p>
    </div>
    <p>
      <u>11.2数矩公司尊重知识产权并注重保护用户享有的各项权利。在数矩服务中，用户可能需要通过上传、发布等各种方式向数矩公司提供内容。在此情况下，用户仍然享有此等内容的完整知识产权。用户承诺在使用数矩提供的服务时发布上传的内容（包括但不限于文字、图片、音视频、软件代码等一切受知识产权保护的内容）均由用户原创或已获合法授权。用户在提供内容时将授予数矩公司一项全球性的免费许可，允许数矩公司使用、传播、复制、修改、再许可、翻译、改编、创作衍生作品、出版、表演及展示此等内容。用户特别授权数矩公司以自己名义或委托第三方对侵犯用户上传发布的享有知识产权内容的行为采取法律行动，包括但不限于投诉、诉讼等必要的维权措施。</u>
    </p>
    
    <p class="title">十二、法律适用及争议解决</p>
    <p>
      <u>12.1本服务条款适用中华人民共和国的法律，并且排除一切冲突法规定的适用。</u>
    </p>
    <p>
      <u>12.2如使用本服务条款项下服务中出现纠纷的，用户与数矩公司应友好协商解决，若协商不成，用户同意将纠纷提交中国国际经济贸易仲裁委员会仲裁解决，并由3名仲裁员进行审理。仲裁裁决是终局的，对双方均有约束力。若单项条款与本服务条款在管辖约定内容上存在冲突，则在单项条款约束范围内应以单项条款为准。</u>
    </p>
    
    <p class="title">十三、青少年用户特别提示</p>
    <p class="text-index">
      青少年用户必须遵守全国青少年网络文明公约：
    </p>
    <p class="text-index">
      要善于网上学习，不浏览不良信息；要诚实友好交流，不侮辱欺诈他人；要增强自护意识，不随意约会网友；要维护网络安全，不破坏网络秩序；要有益身心健康，不沉溺虚拟时空。
    </p>
    
    <p class="title">十四、其他</p>
    <p>
      15.1数矩公司不行使、未能及时行使或者未充分行使本服务条款或者按照法律规定所享有的权利，不应被视为放弃该权利，也不影响数矩公司在将来行使该权利。
    </p>
    <p>
      15.2如本服务条款中的任何条款无论因何种原因完全或部分无效或不具有执行力，本服务条款的其余条款仍应有效且具有约束力，数矩公司及用户均应尽力使该条款设定的本意得到实现。
    </p>
    <p>
      15.3本服务条款中的标题仅为方便而设，不作为解释本服务条款的依据。
    </p>
  </div>
</template>

<script>
import { defineComponent, reactive, ref } from 'vue'

export default defineComponent({
  name: 'RegisterClause',
  props: {
    msg: { type: String, default: '默认值' }
  },
  
  setup(props, ctx) {

  }
});
</script>

<style lang="less" scoped>
  .egister-clause {
    max-width: 1300px;
    padding: .1rem .1rem .2rem .1rem;
    margin: 0rem auto;
    color: @color-Black-75;
    
    .h1-title {
      font-size: .24rem;
      font-weight: bold;
      text-align: center;
      padding: .1rem 0 .2rem 0;
      color: @color-Black-75;
    }
    
    .text-index {
      text-indent: .3rem;
    }
    
    // 每个段落内容
    p {
      padding: .08rem 0;
      line-height: .32rem;
    }
    
    // div为每段内容， 存在4级内容，在三级内容中使用
    div {
      padding: .08rem 0;
      
      p {
        padding: .01rem 0;
        line-height: .32rem;
      }
    }
    
    // 小标题
    .title {
      padding: .16rem 0 .06rem 0 ;
      font-weight: bold;
    }
    
    // 文字加粗
    span {
      font-weight: bold;
      color: @color-Black-75;
    }
    
    // 文字加粗、下划线效果
    u {
      font-weight: bold;
      text-decoration: underline;
      color: @color-Black-75;
    }
  }
</style>